In [7]:
import pandas as pd

In [8]:
df_brands = pd.read_csv('brands.csv')
df_bt = pd.read_csv('./brand_tieup_2.csv', index_col=0)

df_brands.head()

   product_code brand_cat
0         21474      Test
1         11769      Test
2         17007    Kapiva
3         22188    Kapiva
4         23676    Kapiva

In [9]:
df_bt = df_bt.reset_index()
df_bt.head()

    Month brand_cat brand_sale_range  %applied
0  Feb-25    Kapiva            0-100         2
1  Feb-25    Kapiva          100-200         4
2  Feb-25    Kapiva          200-300         6
3  Feb-25    Kapiva          300-400         8
4  Feb-25    Kapiva          400-500        10

In [10]:
merged_df = df_brands.merge(df_bt, on="brand_cat", how="left")

# Rename product_code to product_id
merged_df.rename(columns={"product_code": "product_id"}, inplace=True)

# Reorder columns as per requirement
final_df = merged_df[["product_id", "brand_cat", "Month", "brand_sale_range", "%applied"]]

# Save the result to a CSV file
final_df.to_csv("merged_output.csv", index=False)

print(final_df)

     product_id brand_cat   Month brand_sale_range  %applied
0         21474      Test  Jul-24            0-100         2
1         21474      Test  Jul-24          100-200         4
2         21474      Test  Jul-24          200-300         6
3         21474      Test  Jul-24          300-400         8
4         21474      Test  Jul-24          400-500        10
..          ...       ...     ...              ...       ...
109       11769      Test  Jul-24          300-400         8
110       11769      Test  Jul-24          400-500        10
111       11769      Test  Jul-24         500-1000        12
112       11769      Test  May-24         100-2000         6
113       11769      Test  May-24     2000-2000000        12

[114 rows x 5 columns]

In [6]:
final_df.head()

   product_id brand_cat   Month brand_sale_range  %applied
0       21474      Test  Jul-24            0-100         2
1       21474      Test  Jul-24          100-200         4
2       21474      Test  Jul-24          200-300         6
3       21474      Test  Jul-24          300-400         8
4       21474      Test  Jul-24          400-500        10